package header

import "strings"

func getBanner() string {
	banner := `
██████╗  ██████╗      ███████╗ ██████╗ █████╗ ███╗   ██╗
██╔══██╗██╔════╝      ██╔════╝██╔════╝██╔══██╗████╗  ██║
██████╔╝██║  ███╗     ███████╗██║     ███████║██╔██╗ ██║
██╔══██╗██║   ██║     ╚════██║██║     ██╔══██║██║╚██╗██║
██████╔╝╚██████╔╝     ███████║╚██████╗██║  ██║██║ ╚████║
╚═════╝  ╚═════╝      ╚══════╝ ╚═════╝╚═╝  ╚═╝╚═╝  ╚═══╝
`
	banner = strings.Replace(banner, "\n", "", 1)
	return banner
}

func (m Model) View() string {
	banner := bannerStyle(
		m.layout.Header.Width,
		m.layout.Header.Height,
	).Render(getBanner())
	return banner
}
